# Lab 12. Re

В качестве задания предлагается решить любые две задачи из приведённых ниже.
При решении надо использовать регулярные выражения!


## Задача 1 («Money, Money, Money»)

Надо найти все денежные суммы в тексте.
Пусть валюта указывается только в рублях, долларах и евро.
Например, в тексте
```
Молоко стоит $2.
Один билет в Сан-Франциско и обратно стоит 30000 ₽, а 2 билета — всего 50000₽!
€1 = 83₽ (2021 год, 22 ноября).
```
программа должна найти числа `2`, `30000`, `50000`, `1`, `90`.


## Задача 2 («Books»)

Надо найти все названия книг в тексте.
Например, в тексте
```
Я сейчас читаю «Случайную вакансию» Джоан Роулинг.
Не знаю, как тебе, а мне книга «Террор» Симмонса показалась очень затянутой.
Конечно, я читал Гарри Поттера! Но вот фильм «Гарри Поттер и Кубок огня» мне совершенно не понравился!
```
упоминаются книги (форма слов — как в тексте): `Случайную вакансию`, `Террор`, `Гарри Поттера`.


## Задача 3 («Functions»)

Есть файл с Python кодом.
Надо найти в нём все функции (асинхронные можно пропустить).
Примем, что отступы состоят из пробелов.
Например, в файле с таким содержимым
```python
def print_hello():
    print("Hello!")

class Goodbyer:
    def print_goodbye(self):
        print('Bye!')
```
программа должна найти блоки
```python
def print_hello():
    print("Hello!")
```
и
```python
def print_goodbye(self):
    print('Bye!')
```


## Задача 4 («Black Friday»)

Надо снизить цену всех воздушных шариков, "убрав" класс единиц из стоимости.
Например, список цен
```
Шарик красный: 100
Шарик синий: 110
Кофе зерновой: 1000
Шарик пурпурный: 200
Кекс с изюмом: 200
```
надо преобразовать в
```
Шарик красный: 10
Шарик синий: 11
Кофе зерновой: 1000
Шарик пурпурный: 20
Кекс с изюмом: 200
```


## Задача 5 («Where the Boys Are»)

<div>
<em>
  <p align="right">
    In the crowd of a million people, I'll find my valentine...
  </p>
</em>
</div>

Надо найти имена всех мальчиков в списке людей.
Каждая строчка в списке — имя и фамилия.
Например, в списке
```
Тихон Корзюков
Истратов Женя
Лиза Воронцова
Брыгина Ольга
Данила Тарасов
```
должны быть найдены имена `Тихон`, `Женя`, `Данила`.


## Задача 6 («ДНК»)

В некоторых словах есть подслово "днк".
Например, в слове "без**д**ель**н**и**к**".
Надо преобразовать текст так, чтобы во всех таких словах "исчезли" все буквы, кроме подслова "днк".
Под "исчезанием" буквы имеется в виду замена её на пробел.

Например, следующий текст
```
Зазвонил будильник — и начался девичник.
Настоящий художник должен быть с чудинкой.
"Мой любимый раздел физики — конечно же, термодинамика!" — сказал всадник.
Он меня не услышал, потому что засмотрелся на родинку на щеке прекрасной индианки.
Один из двойняшек нашёл в заповеднике большой подсолнечник и — вот дьяволёнок! — срезал его.
```
преобразуется в
```
Зазвонил   д   н к — и начался д    н к.
Настоящий   д  н к должен быть с   д нк  .
"Мой любимый раздел физики — конечно же,      д н   к !" — сказал    дн к.
Он меня не услышал, потому что засмотрелся на   д нк  на щеке прекрасной   д  нк .
Один из д   н   к нашёл в       дн к  большой   д   н    к и — вот д      н к! — срезал его.
```

Если в одном слове есть несколько подслов "днк", то можно оставить любое.
(Но полезно при этом понимать, какое именно подслово оставляет регулярное выражение и почему.)


## Задача 7 («Цензор»)

Мы живём (всегда жили?) в век цензуры.
Так, сигареты [замазываются](https://dtf.ru/u/3351-vadim-elistratov/987583-zagadochnoe-delo-o-zamazannoy-sigarete-v-chetvertoy-matrice),
мужские достоинства [вырезаются](https://www.polygon.com/23467043/black-panther-wakanda-forever-namor-bulge),
женские — [заменяются на фрукты](https://dtf.ru/games/869120-frukty-vmesto-zhenshchiny-blizzard-zamenila-dve-otkrovennyh-kartiny-v-world-of-warcraft),
а Джованни, возможно, [готовится принять солнечную ванну](https://www.vedomosti.ru/society/news/2022/11/24/951902-gosduma-prinyala-zakon-o-zaprete-lgbt) температурой 451&nbsp;°F...

Так не будем же отставать от "тренда"!
Напишите программу с регуляркой, которая бы прятала (забивала звёздочками) "сомнительные" выражения в тексте.

Например, вход:
```
— Вот как... вы сопротивляетесь! — воскликнул де Жюссак.
— Тысяча чертей! Вас это удивляет?

— Дурак! Подпись: Oberst Schroder, скотина! Есть? Повтори!
— Oberst Schroder, скотина...
— Наконец-то, дубина! Кто принял телефонограмму?
— Я.
— Himmelherrgott! Кто это — «я»?
— Швейк. Что ещё?

Вино хлынуло, растекаясь по площади.
Смеющиеся уроды кинулись к ручейкам, опустились на четвереньки.
```

(*Oberst Schroder* — Полковник Шрёдер (нем.), *Himmelherrgott* — А, чтобы тебя чёрт подрал! (нем.))

Выход:
```
— Вот как... вы сопротивляетесь! — воскликнул де Жюссак.
— Тысяча ч****й! Вас это удивляет?

— Д***к! Подпись: Oberst Schroder, с*****а! Есть? Повтори!
— Oberst Schroder, с*****а...
— Наконец-то, д****а! Кто принял телефонограмму?
— Я.
— Himmelherrgott! Кто это — «я»?
— Швейк. Что ещё?

Вино хлынуло, растекаясь по площади.
Смеющиеся у***ы кинулись к ручейкам, опустились на четвереньки.
```


## Задача 8 («Chamomile Field»)

Замените с помощью регулярок в тексте все "ромашки" на "стекляшки".

Вход:
```
Ромашковое поле

Солнышко светит,
И я иду.
Куда — сама не знаю.
Чего-то жду.

И вот, за поворотом —
Огонь в глаза:
Ромашковое поле,
Без края и конца...

Боюсь шагнуть —
Вдруг обожгусь?
Боюсь зайти —
Вдруг не вернусь?

...Вернусь — куда?
Туда, где пусто.
Туда, где лишь ждала всегда
Того, кто б тоже ждал.

Пускай ж меня проглотит!
Это поле,
Поле из ромашек.
Пускай я утону!
И в нём ромашек,
Ромашек станет больше — на одну...

Вокруг — осколки солнца,
И я иду.
Куда, зачем — не знаю.
И ничего не жду.
```

Выход:
```
Стекляшковое поле

Солнышко светит,
И я иду.
Куда — сама не знаю.
Чего-то жду.

И вот, за поворотом —
Огонь в глаза:
Стекляшковое поле,
Без края и конца...

Боюсь шагнуть —
Вдруг обожгусь?
Боюсь зайти —
Вдруг не вернусь?

...Вернусь — куда?
Туда, где пусто.
Туда, где лишь ждала всегда
Того, кто б тоже ждал.

Пускай ж меня проглотит!
Это поле,
Поле из стекляшек.
Пускай я утону!
И в нём стекляшек,
Стекляшек станет больше — на одну...

Вокруг — осколки солнца,
И я иду.
Куда, зачем — не знаю.
И ничего не жду.
```


# P.S.

При решении задач достаточно, чтобы программа корректно работала только на приведённом примере.
Но это не значит, что можно в код программы просто взять и "зашить" текст примера! :)

# P.P.S.

В [лабе про регулярки](http://cs.mipt.ru/advanced_python/lessons/lab12.html) много несложных (и не только несложных) упражнений.
Рекомендуется их дорешать ко конца!

# Ссылки

* [re](https://docs.python.org/3/library/re.html) — документация по билиотке `re` Питона
* [regex101.com](https://regex101.com/) — сайт, где можно поиграться с регулярными выражениями

## Отрывки из книг

* «Три мушкетёра», Александр Дюма
* «Похождения бравого солдата Швейка», Ярослав Гашек
* «Дочь железного дракона», Майкл Суэнвик
